Repository: zviratko/omlx
Catalog: apps/omlx-mac/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# quant.about.table.oq.use
source: Fast, deterministic conversion with strong baseline quality
ru: Быстрое детерминированное преобразование с хорошим базовым качеством
zh_hans: 快速、确定性的转换，具有强基线质量

# quant.about.table.oqe.bits
source: Same oQ plan
ru: Тот же план oQ
zh_hans: 相同的 oQ 方案

# quant.about.table.oqe.affine
source: imatrix-weighted clipping/search per group
ru: Клиппинг/поиск по группам с весами imatrix
zh_hans: 每组 imatrix 加权裁剪/搜索

# quant.about.table.oqe.use
source: Better low-bit retention, especially for MoE and activation-skewed layers
ru: Лучшее сохранение качества при малой битности, особенно для MoE и слоёв с неравномерными активациями
zh_hans: 更好的低位保留，特别是对于 MoE 和激活偏斜层

# quant.advanced.dtype.label
source: Non-quant dtype
ru: dtype без квантования
zh_hans: 非量化数据类型

# quant.advanced.dtype.sub
source: Precision for tensors that stay un-quantized (norms, scales)
ru: Точность тензоров, которые не квантуются (norms, scales)
zh_hans: 保持未量化的张量（范数、缩放）的精度

# quant.advanced.preserve_mtp.label
source: Preserve MTP
ru: Сохранять MTP
zh_hans: 保留 MTP

# quant.advanced.preserve_mtp.sub.available
source: Keep multi-token prediction heads in the quantized output
ru: Сохранять головы multi-token prediction в квантованном результате
zh_hans: 在量化输出中保留多 Token 预测头

# quant.advanced.preserve_mtp.sub.unavailable
source: Unavailable — source model has no MTP heads
ru: Недоступно — у исходной модели нет MTP-голов
zh_hans: 不可用 — 源模型没有 MTP 头

# quant.advanced.text_only.label
source: Text only
ru: Только текст
zh_hans: 仅文本

# quant.advanced.text_only.sub
source: Exclude vision encoder weights (~2-3% smaller, text-only output)
ru: Исключить веса vision encoder (~2-3% меньше, результат только для текста)
zh_hans: 排除视觉编码器权重（约小 2-3%，仅文本输出）

# quant.advanced.title
source: Advanced settings
ru: Дополнительные настройки
zh_hans: 高级设置

# quant.button.start
source: Start Quantization
ru: Начать квантование
zh_hans: 开始量化

# quant.button.starting
source: Starting…
ru: Запуск…
zh_hans: 开始中…

# quant.enhanced.cache_path.label
source: Imatrix cache path
ru: Путь к кэшу imatrix
zh_hans: imatrix 缓存路径

# quant.enhanced.cache_path.placeholder
source: Automatic
ru: Автоматически
zh_hans: 自动

# quant.enhanced.cache_path.sub
source: Leave empty to use an automatic cache location.
ru: Оставьте пустым, чтобы использовать автоматическое расположение кэша.
zh_hans: 留空以使用自动缓存位置。

# quant.enhanced.enable.label
source: Enable oQe
ru: Включить oQe
zh_hans: 启用 oQe

# quant.enhanced.enable.sub
source: Collect activation importance and use it to reduce affine quantization error.
ru: Собирать важность активаций и использовать её, чтобы снизить ошибку аффинного квантования.
zh_hans: 收集激活重要性并用于减少仿射量化误差。

# quant.enhanced.reuse.label
source: Reuse imatrix cache
ru: Повторно использовать кэш imatrix
zh_hans: 复用 imatrix 缓存

# quant.enhanced.reuse.sub
source: Use a compatible cached imatrix when available; otherwise collect a new one.
ru: Использовать совместимую imatrix из кэша, если она доступна; иначе собрать новую.
zh_hans: 可用时使用兼容的已缓存 imatrix；否则重新收集。

# quant.enhanced.strict.label
source: Strict imatrix coverage
ru: Строгое покрытие imatrix
zh_hans: 严格 imatrix 覆盖

# quant.enhanced.strict.sub
source: Fail when a quantized tensor has no matching imatrix entry instead of falling back to standard oQ.
ru: Завершать с ошибкой, если для квантуемого тензора нет подходящей записи imatrix, вместо отката к стандартному oQ.
zh_hans: 当量化张量没有匹配的 imatrix 条目时报错，而不是回退到标准 oQ。

# quant.enhanced.subtitle
source: Use imatrix calibration to weight affine quantization by activation importance.
ru: Использовать калибровку imatrix, чтобы взвешивать аффинное квантование по важности активаций.
zh_hans: 使用 imatrix 校准，按激活重要性加权仿射量化。

# quant.enhanced.title
source: Enhanced quantization (oQe)
ru: Улучшенное квантование (oQe)
zh_hans: 增强量化（oQe）

# quant.empty_models
source: No full-precision models found on disk. Download one from the Downloads tab first.
ru: На диске не найдены full-precision модели. Сначала скачайте модель на вкладке «Загрузки».
zh_hans: 磁盘上未找到全精度模型。先从下载标签页下载一个。

# quant.error.server_refused
source: Server refused the request
ru: Сервер отклонил запрос
zh_hans: 服务器拒绝了请求

# quant.estimate.bpw
source: Effective %@ bpw
ru: Эффективно %@ bpw
zh_hans: 有效 %@ bpw

# quant.estimate.calculating
source: Calculating…
ru: Расчет…
zh_hans: 计算中…

# quant.estimate.memory
source: Est. memory: ~%@
ru: Оценка памяти: ~%@
zh_hans: 预估内存：~%@

# quant.estimate.output_size
source: Output size: ~%@
ru: Размер результата: ~%@
zh_hans: 输出大小：~%@

# quant.header.eyebrow
source: oQ Quantization
ru: Квантование oQ
zh_hans: oQ 量化

# quant.header.subtitle
source: Pick a full-precision model, choose an oQ level, and oMLX builds a mixed-precision plan tuned to that model's per-layer sensitivity. Output is standard mlx-lm safetensors — usable in any MLX runtime.
ru: Выберите full-precision модель и уровень oQ, а oMLX построит mixed-precision план, настроенный под послойную чувствительность этой модели. Результат — стандартные safetensors mlx-lm, пригодные для любого MLX runtime.
zh_hans: 选择一个全精度模型，选择 oQ 级别，oMLX 会构建一个针对该模型每层敏感度调整的混合精度计划。输出是标准 mlx-lm safetensors — 可在任何 MLX 运行时中使用。

# quant.header.title
source: Quantize on device
ru: Квантование на устройстве
zh_hans: 在设备上量化

# quant.queue.cancel.help
source: Cancel
ru: Отменить
zh_hans: 取消

# quant.queue.remove.help
source: Remove
ru: Удалить
zh_hans: 移除

# quant.queue.subtitle
source: Tasks: %lld
ru: Задач: %lld
zh_hans: 任务：%lld

# quant.queue.title
source: Queue
ru: Очередь
zh_hans: 队列

# quant.queue.upload
source: Upload to HF
ru: Загрузить на HF
zh_hans: 上传到 HuggingFace

# quant.queue.upload.help
source: Upload to Hugging Face Hub
ru: Загрузить на Hugging Face Hub
zh_hans: 上传到 Hugging Face Hub

# quant.source.option.no_sensitivity
source: None (use source model)
ru: Нет (использовать исходную модель)
zh_hans: 无（使用源模型）

# quant.source.option.select
source: Select a model…
ru: Выберите модель…
zh_hans: 选择模型…

# quant.source.row.level.label
source: oQ level
ru: Уровень oQ
zh_hans: oQ 级别

# quant.source.row.level.sub
source: Lower bits = smaller, faster, less accurate
ru: Меньше битов = компактнее, быстрее, но менее точно
zh_hans: 更低位 = 更小、更快、准确度更低

# quant.source.row.sensitivity.label
source: Sensitivity model
ru: Модель чувствительности
zh_hans: 敏感度模型

# quant.source.row.sensitivity.sub
source: Use a quantized variant to analyze layer sensitivity with ~4× less memory
ru: Использовать квантованный вариант для анализа чувствительности слоев примерно с 4× меньшей памятью
zh_hans: 使用量化变体以约 4 倍少的内存分析层敏感度

# quant.source.row.source.label
source: Source
ru: Источник
zh_hans: 源

# quant.source.row.source.sub
source: Only full-precision models can be quantized
ru: Квантовать можно только full-precision модели
zh_hans: 只能量化全精度模型

# quant.source.subtitle.available
source: Full-precision models available: %lld
ru: Доступно full-precision моделей: %lld
zh_hans: 可用全精度模型：%lld

# quant.source.subtitle.loading
source: Loading…
ru: Загрузка…
zh_hans: 加载中…

# quant.source.title
source: Source Model
ru: Исходная модель
zh_hans: 源模型

# quant.status.cancelled
source: Cancelled
ru: Отменено
zh_hans: 已取消

# quant.status.completed
source: Completed
ru: Завершено
zh_hans: 已完成

# quant.status.failed
source: Failed
ru: Ошибка
zh_hans: 失败

# quant.status.loading
source: Loading
ru: Загрузка
zh_hans: 加载中

# quant.status.pending
source: Pending
ru: Ожидание
zh_hans: 待处理

# quant.status.quantizing
source: Quantizing
ru: Квантование
zh_hans: 量化中

# quant.status.saving
source: Saving
ru: Сохранение
zh_hans: 保存中

# quant.success.started
source: Quantization started: %1$@ → %2$@
ru: Квантование начато: %1$@ → %2$@
zh_hans: 量化已开始：%1$@ → %2$@

# quant.upload_modal.credentials.subtitle.logged_in
source: Logged in as @%@
ru: Вход выполнен как @%@
zh_hans: 已登录为 @%@

# quant.upload_modal.credentials.subtitle.needs_validate
source: Validate a token to enable upload
ru: Проверьте токен, чтобы включить загрузку
zh_hans: 验证令牌以启用上传

# quant.upload_modal.credentials.title
source: Credentials
ru: Учётные данные
zh_hans: 凭据

# quant.upload_modal.namespace.label
source: Target namespace
ru: Целевой namespace
zh_hans: 目标命名空间

# quant.upload_modal.namespace.sub.unvalidated
source: Available after validation
ru: Доступно после проверки
zh_hans: 验证后可用

# quant.upload_modal.namespace.sub.user_only
source: Your account is the only available namespace
ru: Ваш аккаунт — единственный доступный namespace
zh_hans: 你的账户是唯一可用的命名空间

# quant.upload_modal.namespace.sub.with_orgs
source: Publish under your account or one of your orgs
ru: Публиковать в вашем аккаунте или одной из организаций
zh_hans: 在你的账户或你的组织之一下发布

# quant.upload_modal.notice.label.add
source: Add re-download notice
ru: Добавить notice о повторном скачивании
zh_hans: 添加重新下载提示

# quant.upload_modal.notice.label.copied
source: Re-download notice
ru: Notice о повторном скачивании
zh_hans: 重新下载提示

# quant.upload_modal.notice.off
source: Off
ru: Выкл.
zh_hans: 关闭

# quant.upload_modal.notice.sub.add
source: Append a banner reminding downstream users to re-pull
ru: Добавить баннер, напоминающий downstream-пользователям скачать модель заново
zh_hans: 追加一个横幅，提醒下游用户重新拉取

# quant.upload_modal.notice.sub.copied
source: Disabled when copying an existing README
ru: Отключено при копировании существующего README
zh_hans: 复制现有 README 时禁用

# quant.upload_modal.private.label
source: Private repo
ru: Приватный репозиторий
zh_hans: 私有仓库

# quant.upload_modal.private.sub
source: Only you and your org will see this model
ru: Только вы и ваша организация увидите эту модель
zh_hans: 只有你和你的组织能看到此模型

# quant.upload_modal.readme_source.auto
source: Auto-generate
ru: Создать автоматически
zh_hans: 自动生成

# quant.upload_modal.readme_source.copy_from
source: Copy from %@
ru: Скопировать из %@
zh_hans: 从 %@ 复制

# quant.upload_modal.readme_source.label
source: Source
ru: Источник
zh_hans: 源

# quant.upload_modal.readme_source.sub
source: Generate a default card or copy from another local model
ru: Создать карточку по умолчанию или скопировать из другой локальной модели
zh_hans: 生成默认卡片或从另一个本地模型复制

# quant.upload_modal.repo_name.label
source: Repo name
ru: Имя репозитория
zh_hans: 仓库名称

# quant.upload_modal.repo_name.sub
source: Full repo id will be %@/<repo-name>
ru: Полный repo id будет %@/<repo-name>
zh_hans: 完整仓库 ID 将为 %@/<仓库名>

# quant.upload_modal.repo.title
source: Repository
ru: Репозиторий
zh_hans: 仓库

# quant.upload_modal.title
source: Upload to Hugging Face
ru: Загрузить на Hugging Face
zh_hans: 上传到 Hugging Face

# quant.upload_modal.token.label
source: HF token
ru: HF-токен
zh_hans: HuggingFace 令牌

# quant.upload_modal.token.revalidate
source: Re-validate
ru: Проверить снова
zh_hans: 重新验证

# quant.upload_modal.token.sub
source: Stored in macOS Keychain. Needs write access to your account.
ru: Хранится в macOS Keychain. Нужен доступ на запись в ваш аккаунт.
zh_hans: 存储在 macOS 钥匙串中。需要对你账户的写入权限。

# quant.upload_modal.token.validate
source: Validate
ru: Проверить
zh_hans: 验证

# quant.upload_modal.token.validating
source: Validating…
ru: Проверка…
zh_hans: 验证中…

# quant.upload_modal.upload
source: Upload
ru: Загрузить
zh_hans: 上传

# quant.upload_modal.uploading
source: Uploading…
ru: Загрузка…
zh_hans: 上传中…

# quant.upload_status.cancelled
source: Cancelled
ru: Отменено
zh_hans: 已取消

# quant.upload_status.completed
source: Completed
ru: Завершено
zh_hans: 已完成

# quant.upload_status.failed
source: Failed
ru: Ошибка
zh_hans: 失败

# quant.upload_status.pending
source: Pending
ru: Ожидание
zh_hans: 待处理

# quant.upload_status.uploading
source: Uploading
ru: Загрузка
zh_hans: 上传中

# quant.upload.error.empty_token
source: Token is empty
ru: Токен пуст
zh_hans: 令牌为空

# quant.upload.error.server_refused
source: Server refused the request
ru: Сервер отклонил запрос
zh_hans: 服务器拒绝了请求

# quant.upload.error.start_failed
source: Upload failed: %@
ru: Загрузка не удалась: %@
zh_hans: 上传失败：%@

# quant.upload.error.validate_failed
source: Validate failed: %@
ru: Проверка не удалась: %@
zh_hans: 验证失败：%@

# quant.uploads.cancel.help
source: Cancel
ru: Отменить
zh_hans: 取消

# quant.uploads.open
source: Open
ru: Открыть
zh_hans: 打开

# quant.uploads.remove.help
source: Remove
ru: Удалить
zh_hans: 移除

# quant.uploads.subtitle
source: Active: %1$lld / completed: %2$lld
ru: Активно: %1$lld / завершено: %2$lld
zh_hans: 活动：%1$lld / 已完成：%2$lld

# quant.uploads.title
source: Uploads
ru: Загрузки на HF
zh_hans: 上传

# security.api_key.copy
source: Copy to clipboard
ru: Скопировать в буфер
zh_hans: 复制到剪贴板

# security.api_key.generate
source: Generate a random key
ru: Сгенерировать случайный ключ
zh_hans: 生成随机密钥

# security.api_key.hide
source: Hide key
ru: Скрыть ключ
zh_hans: 隐藏密钥

# security.api_key.row_label
source: API Key
ru: API-ключ
zh_hans: API 密钥

# security.api_key.save
source: Save
ru: Сохранить
zh_hans: 保存

# security.api_key.saving
source: Saving…
ru: Сохранение…
zh_hans: 正在保存…

# security.api_key.show
source: Show key
ru: Показать ключ
zh_hans: 显示密钥

# security.api_key.sublabel.set
source: Used to authenticate /v1 and admin requests. ≥ 4 printable chars, no whitespace.
ru: Используется для аутентификации запросов /v1 и admin. ≥ 4 печатных символа, без пробелов.
zh_hans: 用于验证 /v1 和管理员请求。至少 4 个可打印字符，不含空格。

# security.api_key.sublabel.unset
source: Set one before exposing the server. ≥ 4 printable chars, no whitespace.
ru: Задайте ключ перед публикацией сервера. ≥ 4 печатных символа, без пробелов.
zh_hans: 在公开服务器之前设置一个。至少 4 个可打印字符，不含空格。

# security.auth.disable_verify
source: Disable API Key Verification
ru: Отключить проверку API-ключа
zh_hans: 禁用 API 密钥验证

# security.auth.disable_verify.sub
source: Allow unauthenticated /v1 and admin requests. Use for development only.
ru: Разрешить неаутентифицированные запросы /v1 и admin. Используйте только для разработки.
zh_hans: 允许未经身份验证的 /v1 和管理员请求。仅用于开发。

# security.section.api_key
source: API Key
ru: API-ключ
zh_hans: API 密钥

# security.section.api_key.sub
source: Required to authenticate /v1 requests and admin sessions
ru: Требуется для аутентификации запросов /v1 и admin-сессий
zh_hans: 验证 /v1 请求和管理员会话所需

# security.section.authentication
source: Authentication
ru: Аутентификация
zh_hans: 身份验证

# security.section.sub_keys
source: Sub Keys
ru: Дочерние ключи
zh_hans: 子密钥

# security.section.sub_keys.sub
source: Issue scoped keys for individual apps or users. Sub keys cannot grant admin access.
ru: Выпускайте ключи с ограниченной областью для отдельных приложений или пользователей. Дочерние ключи не дают admin-доступ.
zh_hans: 为单个应用或用户签发受限密钥。子密钥无法授予管理员访问权限。

# security.sub_keys.created_at
source: Created · %@
ru: Создан · %@
zh_hans: 创建于 · %@

# security.sub_keys.created_raw
source: Created · %@
ru: Создан · %@
zh_hans: 创建于 · %@

# security.sub_keys.created_unknown
source: Created · unknown
ru: Создан · неизвестно
zh_hans: 创建于 · 未知

# security.sub_keys.empty
source: No sub keys yet.
ru: Дочерних ключей пока нет.
zh_hans: 暂无子密钥。

# security.sub_keys.key_label
source: Key
ru: Ключ
zh_hans: 密钥

# security.sub_keys.name_label
source: Name
ru: Имя
zh_hans: 名称

# security.sub_keys.name_placeholder
source: Claude Code on laptop
ru: Claude Code на ноутбуке
zh_hans: 笔记本电脑上的 Claude Code

# security.sub_keys.name_sub
source: Optional human-readable label
ru: Необязательная понятная метка
zh_hans: 可选的可读标签

# security.sub_keys.new
source: New
ru: Новый
zh_hans: 新建

# security.sub_keys.revoke
source: Revoke
ru: Отозвать
zh_hans: 撤销

# security.sub_keys.unnamed
source: (unnamed)
ru: (без имени)
zh_hans: （未命名）

# server.advanced.aliases
source: Server Aliases
ru: Алиасы сервера
zh_hans: 服务器别名

# server.advanced.aliases.sub
source: Extra host names the server identifies as. Comma-separated. Used for cookie / Host header matching.
ru: Дополнительные имена хостов, с которыми сервер себя отождествляет. Через запятую. Используется для cookie / сопоставления Host header.
zh_hans: 服务器识别的额外主机名。逗号分隔。用于 Cookie / Host 头匹配。

# server.advanced.max_audio_upload_size
source: Maximum Audio Upload Size
ru: Максимальный размер загрузки аудио
zh_hans: 最大音频上传大小

# server.advanced.max_audio_upload_size.sub
source: Maximum file size accepted by audio transcription and processing endpoints. Higher values can increase memory use for concurrent requests.
ru: Максимальный размер файла для расшифровки и обработки аудио. Большие значения могут увеличить использование памяти при одновременных запросах.
zh_hans: 音频转录和处理接口接受的最大文件大小。较大的值可能会增加并发请求的内存使用量。

# server.advanced.sse_keepalive
source: SSE Keep-Alive Mode
ru: Режим SSE keep-alive
zh_hans: SSE 保活模式

# server.advanced.sse_keepalive.chunk
source: Chunk
ru: Фрагмент
zh_hans: 数据块

# server.advanced.sse_keepalive.comment
source: Comment
ru: Комментарий
zh_hans: 注释

# server.advanced.sse_keepalive.off
source: Off
ru: Выкл.
zh_hans: 关闭

# server.advanced.sse_keepalive.sub
source: How the server keeps long-lived SSE streams open. "chunk" emits an empty data line, "comment" emits `: ping`, "off" disables.
ru: Как сервер удерживает открытыми долгоживущие SSE-потоки. "chunk" отправляет пустую data-строку, "comment" отправляет `: ping`, "off" отключает режим.
zh_hans: 服务器如何保持长连接 SSE 流打开。'chunk' 发送空数据行，'comment' 发送 ': ping'，'off' 禁用。

# server.button.apply
source: Apply
ru: Применить
zh_hans: 应用

# server.endpoint.health
source: Health probe
ru: Проверка health
zh_hans: 健康探测

# server.endpoint.metrics
source: Metrics (Prometheus)
ru: Метрики (Prometheus)
zh_hans: 指标 (Prometheus)

# server.endpoint.openai
source: OpenAI-compatible
ru: OpenAI-совместимый
zh_hans: OpenAI 兼容

# server.error.audio_upload_size_invalid
source: Maximum Audio Upload Size must be a positive value such as 100MB or 1GB.
ru: Максимальный размер загрузки аудио должен быть положительным значением, например 100MB или 1GB.
zh_hans: 最大音频上传大小必须是正值，例如 100MB 或 1GB。

# server.error.base_path_empty
source: Base path cannot be empty.
ru: Базовый путь не может быть пустым.
zh_hans: 基础路径不能为空。

# server.error.context_window_invalid
source: Context Window must be a positive integer.
ru: Размер контекста должен быть положительным целым числом.
zh_hans: 上下文窗口必须是正整数。

# server.error.max_tokens_invalid
source: Max Tokens must be a positive integer.
ru: Максимальное число токенов должно быть положительным целым числом.
zh_hans: 最大 Token 数必须是正整数。

# server.error.models_dir_empty
source: Models Directory cannot be empty.
ru: Каталог моделей не может быть пустым.
zh_hans: 模型目录不能为空。

# server.error.nothing_to_apply
source: Nothing to apply — both fields match the current config.
ru: Нечего применять — оба поля совпадают с текущей конфигурацией.
zh_hans: 无更改可应用 — 两个字段均匹配当前配置。

# server.error.port_invalid
source: Port must be a number between 1 and 65535.
ru: Порт должен быть числом от 1 до 65535.
zh_hans: 端口必须是 1 到 65535 之间的数字。

# server.error.repetition_penalty_invalid
source: Repetition Penalty must be a non-negative number.
ru: Штраф за повторение должен быть неотрицательным числом.
zh_hans: 重复惩罚必须是非负数。

# server.error.temperature_invalid
source: Temperature must be a number in [0, 2].
ru: Temperature должно быть числом в диапазоне [0, 2].
zh_hans: 温度必须是 [0, 2] 范围内的数字。

# server.error.top_k_invalid
source: Top K must be ≥ 0.
ru: Top K должен быть ≥ 0.
zh_hans: Top K 必须 ≥ 0。

# server.error.top_p_invalid
source: Top P must be a number in [0, 1].
ru: Top P должен быть числом в диапазоне [0, 1].
zh_hans: Top P 必须是 [0, 1] 范围内的数字。

# server.footer.hint
source: Endpoints update live as you change Listen Address and Port. Some changes (host, port) take effect after a server restart.
ru: Эндпоинты обновляются сразу при изменении адреса прослушивания и порта. Некоторые изменения (host, port) вступают в силу после перезапуска сервера.
zh_hans: 端点随你更改监听地址和端口而实时更新。某些更改（主机、端口）在服务器重启后生效。

# server.hero.pill.unresponsive
source: Unresponsive
ru: Не отвечает
zh_hans: 无响应

# server.hero.restart
source: Restart
ru: Перезапустить
zh_hans: 重启

# server.hero.start
source: Start Server
ru: Запустить сервер
zh_hans: 启动服务器

# server.hero.stop
source: Stop
ru: Остановить
zh_hans: 停止

# server.hero.subtitle.listening
source: Listening on %1$@:%2$@
ru: Слушает на %1$@:%2$@
zh_hans: 正在监听 %1$@:%2$@

# server.hero.subtitle.not_running
source: Not running
ru: Не запущен
zh_hans: 未运行

# server.hero.subtitle.starting
source: Starting on %1$@:%2$@…
ru: Запускается на %1$@:%2$@…
zh_hans: 正在启动 %1$@:%2$@…

# server.hero.subtitle.stopping
source: Stopping…
ru: Остановка…
zh_hans: 正在停止…

# server.hero.title
source: oMLX Server
ru: Сервер oMLX
zh_hans: oMLX 服务器

# server.hero.working
source: Working…
ru: Выполняется…
zh_hans: 正在处理…

# server.host.all_networks
source: 0.0.0.0 & :: (All Networks)
ru: 0.0.0.0 & :: (все сети)
zh_hans: 0.0.0.0 & ::（所有网络）

# server.host.ipv4_only
source: 0.0.0.0 (IPv4 only)
ru: 0.0.0.0 (только IPv4)
zh_hans: 0.0.0.0（所有网络）

# server.host.local_only
source: 127.0.0.1 (Local only)
ru: 127.0.0.1 (только локально)
zh_hans: 127.0.0.1（仅本地）

# server.log_level.debug
source: Debug
ru: Отладка
zh_hans: 调试

# server.log_level.error
source: Error
ru: Ошибка
zh_hans: 错误

# server.log_level.info
source: Info
ru: Информация
zh_hans: 信息

# server.log_level.trace
source: Trace
ru: Трассировка
zh_hans: 追踪

# server.log_level.warning
source: Warning
ru: Предупреждение
zh_hans: 警告

# server.model_dirs.add.help
source: Add model directory
ru: Добавить каталог моделей
zh_hans: 添加模型目录

# server.model_dirs.browse.help
source: Choose folder
ru: Выбрать папку
zh_hans: 选择文件夹

# server.model_dirs.browse.message
source: Choose a directory containing MLX model folders.
ru: Выберите каталог с папками MLX-моделей.
zh_hans: 选择包含 MLX 模型文件夹的目录。

# server.model_dirs.browse.prompt
source: Select
ru: Выбрать
zh_hans: 选择

# server.model_dirs.primary
source: Primary
ru: Основной
zh_hans: 主要

# server.model_dirs.remove.help
source: Remove model directory
ru: Удалить каталог моделей
zh_hans: 移除模型目录

# server.profile.context_window
source: Context Window
ru: Окно контекста
zh_hans: 上下文窗口

# server.profile.context_window.sub
source: Maximum prompt + completion tokens.
ru: Максимум токенов промпта + completion.
zh_hans: 最大提示 + 完成 Token 数。

# server.profile.enable_thinking
source: Enable Thinking
ru: Включить thinking
zh_hans: 启用思考

# server.profile.enable_thinking.note
source: Per-model only — set on a profile.
ru: Только для модели — задается в профиле.
zh_hans: 仅每个模型 — 在配置文件上设置。

# server.profile.force_sampling
source: Force Sampling
ru: Принудительное сэмплирование
zh_hans: 强制采样

# server.profile.force_sampling.note
source: Per-model only.
ru: Только для модели.
zh_hans: 仅每个模型。

# server.profile.limit_tool_output
source: Limit Tool Output
ru: Ограничить вывод инструментов
zh_hans: 限制工具输出

# server.profile.limit_tool_output.note
source: Per-model only.
ru: Только для модели.
zh_hans: 仅每个模型。

# server.profile.max_tokens
source: Max Tokens
ru: Максимум токенов
zh_hans: 最大 Token 数

# server.profile.max_tokens.sub
source: Server-wide cap on generated tokens.
ru: Серверный лимит сгенерированных токенов.
zh_hans: 服务器范围的生成 Token 上限。

# server.profile.min_p.note
source: Server defaults don't include min_p; set on a model profile.
ru: Значения сервера по умолчанию не включают min_p; задайте его в профиле модели.
zh_hans: 服务器默认值不包含 min_p；在模型配置文件上设置。

# server.profile.per_model_only
source: Per-model only
ru: Только для модели
zh_hans: 仅每个模型

# server.profile.pin_in_memory
source: Pin in memory
ru: Закрепить в памяти
zh_hans: 固定在内存中

# server.profile.pin_in_memory.note
source: Per-model only - see Models > [model] > Advanced.
ru: Только для модели — см. Модели → [модель] → Дополнительно.
zh_hans: 仅每个模型 — 参见 模型 → [模型] → 高级。

# server.profile.presence_penalty
source: Presence Penalty
ru: Presence-штраф
zh_hans: 存在惩罚

# server.profile.presence_penalty.note
source: Per-model only.
ru: Только для модели.
zh_hans: 仅每个模型。
